results/results_r5_large/results_r5_large_run2/oltp_read_write_t4/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 18.70 qps: 377.83 (r/w/o: 265.25/20.10/92.48) lat (ms,95%): 467.30 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 19.60 qps: 393.51 (r/w/o: 275.61/21.20/96.70) lat (ms,95%): 559.50 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 27.90 qps: 556.90 (r/w/o: 389.60/29.20/138.10) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 21.00 qps: 420.90 (r/w/o: 294.70/22.50/103.70) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 16.80 qps: 335.00 (r/w/o: 234.40/17.30/83.30) lat (ms,95%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 20.80 qps: 417.00 (r/w/o: 292.40/21.90/102.70) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 18.30 qps: 363.50 (r/w/o: 253.70/19.90/89.90) lat (ms,95%): 580.02 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 19.30 qps: 387.10 (r/w/o: 271.30/21.30/94.50) lat (ms,95%): 539.71 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 17.90 qps: 358.70 (r/w/o: 251.20/19.20/88.30) lat (ms,95%): 539.71 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 19.40 qps: 390.40 (r/w/o: 272.90/21.40/96.10) lat (ms,95%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 31.90 qps: 635.50 (r/w/o: 445.30/33.40/156.80) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 17.60 qps: 353.20 (r/w/o: 247.30/19.10/86.80) lat (ms,95%): 539.71 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            34944
        write:                           2669
        other:                           12307
        total:                           49920
    transactions:                        2496   (20.76 per sec.)
    queries:                             49920  (415.24 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      20.7622
    time elapsed:                        120.2187s
    total number of events:              2496

Latency (ms):
         min:                                   45.87
         avg:                                  192.60
         max:                                  964.82
         95th percentile:                      502.20
         sum:                               480719.33

Threads fairness:
    events (avg/stddev):           624.0000/5.34
    execution time (avg/stddev):   120.1798/0.04